/*********************************************试题一***************************************************/

/*********************************************程序填空*************************************************/
#include <stdio.h>
#define N 5
typedef struct student
{
    long sno;
    char name[10];
    float score[3];
} STU;
void fun(char *filename, STU n)
{
    FILE *fp;
    /**********found**********/
    fp = fopen(filename, "rb+"); //打开文件 fp=fopen(文件名，文件使用方式)
    /**********found**********/
    fseek(fp, -(long)sizeof(STU), SEEK_END);//
    /*
    fseek(文件类型指针，位移量，起始点) ；
    起始点有：
    文件开头：SEEK_SET0
    文件当前位置：SEEK_CUR1
    文件末尾：SEEK_END2
    */
    /**********found**********/
    fwrite(&n, sizeof(STU), 1, fp);
    /*
        fwrite(buffer,size,count,fp);
        数据块读写函数，用于向文件读写一些数据，其中，
        buffer是一个指针，表示起始位置；
        size是要读写的字节数；
        count表示读写多少个size字节的数据项；*/
    fclose(fp);
}

文件的打开与关闭
/*
r/rb ：只读
w/wb ：只写
a/ab ：追加
文件类型指针 FILE *fp;
打开文件 fp=fopen(文件名，文件使用方式);
关闭文件 fclose(fp);
注意：文件打开函数和关闭函数的形式，其参数和返回值为文件指针
*/
    文件的读写
    fputc(ch, fp);
    //将字符（ch的值）输出到fp所指向的文件中去
    fgetc(fp);
    //从fp所指向的文件中返回一个字符
    fgets(char *str，int n, FILE *fp);
    //从指向的文件读入一个字符串
    fputs(const str, FILE *fp);
    //向指向的文件输出一个字符串
    fprintf(文件指针，格式字符串，输出表列) ；
        //将字符串输出到文件
        fscanf(文件指针，格式字符串，输入表列) ；
            //从文件读入一个字符串
            fread(buffer, size, count, fp);
    fwrite(buffer, size, count, fp);
    //数据块读写函数，用于向文件读写一些数据，其中，
    /*
buffer是一个指针，表示起始位置；
size是要读写的字节数；
count表示读写多少个size字节的数据项；
*/
    //文件检测函数

    文件检测函数
    int feof(FILE * stream);
    //功能检测是否结束，结束返回1，否则0
    ferror(*fp);
    //返回0表示文件未出错，非零表示出差
    fseek(文件类型指针，位移量，起始点) ；
    /*
起始点有：
文件开头：SEEK_SET0
文件当前位置：SEEK_CUR1
文件末尾：SEEK_END2
重点是考察fseek()函数的调用格式和参数的含义
例如：
    int a=2;
    fseek(fp，0,a)


/*********************************************程序修改*************************************************/

#include <stdio.h>
#include <stdlib.h>
        typedef struct aa
    {
        int data;
        struct aa *next;
    } NODE;
    NODE *Creatlink(int n, int m)
    {
        NODE *h = NULL, *p, *s;
        int i;
        /**********found***********/
        p = (NODE*)malloc(sizeof(NODE));
        /*
        p为指向变量的指针，所以加*
        */
        h = p;
        p->next = NULL;
        for (i = 1; i <= n; i++)
        {
            s = (NODE *)malloc(sizeof(NODE));
            s->data = rand() % m;
            s->next = p->next;
            p->next = s;
            p = p->next;
        }
        /**********found***********/
        return h;
        /*在动态分配内存的下一行语句是，使用临时结构指针变量h保存p指针的的初始位置，最后返回
        不能使用怕，因为p的位置已经发生改变，所以应该是return h；
        */
    }
    void outlink(NODE *h)
    {
        NODE *p;
        p = h->next;
        printf("\n\nTHE  LIST :\n\n  HEAD ");
        while (p)
        {
            printf("->%d ", p->data);
            p = p->next;
        }
        printf("\n");
    }
    void main()
    {
        NODE *head;
        head = Creatlink(8, 22);
        outlink(head);
    }
/*********************************************程序设计*************************************************/
#include <string.h>
#include <stdio.h>
#define N 80
    int fun(char *s)
    {
        int i,j=0;
        for(i=0;s[i]!='\0';i++)//s[i]的值不为空值，继续执行
            if(s[i]!=' '&&(s[i+1]==' '||s[i+1]=='\0'))//最后一个字母不为空且下一个字母为空格或空值
            j++;
            return j;
    }
    void main()
    {
        FILE *wf;
        char line[N];
        int num = 0;
        printf("Enter a string:\n ");
        gets(line);
        num = fun(line);
        printf("The number of word is:%d\n\n ", num);
        /******************************/
        wf = fopen("out.dat", "w");
        fprintf(wf, "%d", fun("a big car"));
        fclose(wf);
        /*****************************/
    }
    /*
首先是如何识别一个是一个单词
如果字母的下一个字符是空格或者是结束标记，则表示一个单词结束，
所以要使用for循环进行遍历整个字符串
        for(i=0;s[i]!='\0',i++)

        a != b
        判断a和b是否不相等
        不相等返回true(真)，否则返回false(假)

然后用if条件语句判断当前字符是否表示一个字母的结束，
        if(s[i]!=''&&(s[i+1]==''||s[i+1]=='\0'))
        \0,空值,其ASCII码值为0,
如果当前字符表示一个单词结束，则存放单词个数加一，
        j++;
最后返回单词个数
        return j;

*/
/*********************************************试题二*************************************************/


/*********************************************程序填空*************************************************/

#include <stdlib.h>
#include <stdio.h>
#define N 10
    double fun(double x[], double *y)
    {
        int i, j;
        double av;
        /**********found**********/
        av = 0.0; // av代表平均值，所以要提前赋初值，double型，所以0.0
        /**********found**********/
        for (i = 0; i < N; i++)
            av = av + x[i]/N;//每个数除以总个数相加等于平均数

        for (i = j = 0; i < N; i++)
            /**********found**********/
            if (x[i] > av)
                y[j++] = x[i];//将值放到y[i]中
            y[j] = -1;
        return av;
    }

    /*
    av代表平均值，所以要提前赋初值，double型，所以0.0



    */
    void main()
    {
        int i;
        double x[N], y[N];
        for (i = 0; i < N; i++)
        {
            x[i] = rand() % 50;
            printf("%4.0f ", x[i]);
        }
        printf("\n");
        printf("\nThe average is: %f\n", fun(x, y));
        for (i = 0; y[i] >= 0; i++)
            printf("%5.1f ", y[i]);
        printf("\n");
    }

/*********************************************程序修改*************************************************/
#include <stdlib.h>
#include <conio.h>
#include <stdio.h>
    /*************found**************/
double fun(int m)  //函数的返回值为double型，所以函数也应该为double型
{
    double y = 0, d;
    int i;
    /*************found**************/
    for (i = 100; i <= m; i += 100) // for( i = 0; i < count; i++)里面的分号，所以把逗号改为分号
    {
    /* code */
    }
        
    {
        d = (double)i * (double)i;
        y += 1.0 / d;
    }
        return (y);
    }
    void main()
    {
        int n = 2000;
        system("CLS");
        printf("\nThe result is %1f\n", fun(n));
    }

/*********************************************程序设计*************************************************/

#include <stdio.h>
#include <string.h>
#include <conio.h>
#include <stdlib.h>
#define N 10
    typedef struct ss
    {
        char num[10];
        int s;
  
    } STU;
  /*************************************/  
    void fun(STU a[], STU *s)
    {
        int i;
        *s = a[0]; /*先认为第1个值最小*/
        for (i = 0; i < N; i++)
            if (s->s > a[i].s) /*如果在循环的过程中再发现比第1个值更小的则赋给*s*/
                *s = a[i];
    }
    /*
找出结构体数组元素中的最小值，先认为第一个元素最小，即*s=a[0];
如果循环过程中发现比第一个更小的值，就将指针元素指向该元素，
直到我们找到更小的元素。

指向结构体成员运算符 : (->) 从外部看是包含了一个解指针（*）所以要对指针进行操作

例如：

typedef struct

{

int data[20];

int length;

}Sqlist;

Sqlist *L;
L->lenth; //同样是得到L中length的值

结构体成员运算符 : ( . )直接调用结构体中的某个成员

例如：

typedef struct

{

int data[20];



*/
    void main()
    {
        FILE *wf;
        STU a[N] = {{"A01", 81}, {"A02", 89}, {"A03", 66}, {"A04", 87}, {"A05", 77}, {"A06", 90}, {"A07", 79}, {"A08", 61}, {"A09", 80}, {"A10", 71}}, m;
        int i;
        system("CLS");
        printf("*****The original data*****\n");
        for (i = 0; i < N; i++)
            printf("No=%s Mark=%d\n", a[i].num, a[i].s);
        fun(a, &m);
        printf("*****THE RESULT*****\n");
        printf("The lowest :%s, %d\n", m.num, m.s);
        /******************************/
        wf = fopen("out.dat", "w");
        fprintf(wf, "%s, %d", m.num, m.s);
        fclose(wf);
        /*****************************/
    }

/*********************************************试题三*************************************************/

/*********************************************程序填空*************************************************/
#include <stdlib.h>
#include <stdio.h>
#define N 10
    double fun(double x[], double *av)
    {
        int i, j;
        double d, s;
        s = 0;
        for (i = 0; i < N; i++)
            s = s + x[i];
        /**********found**********/
        *av= s / N;//s/N代表的就是平均值，所以填写*av
        d = 32767;
        for (i = 0; i < N; i++)
            if (x[i] < *av && *av - x[i] <= d)
            {
                /**********found**********/
                d = *av - x[i];//d的值在不断减小
                j = i;  //将最接近最小值 的下标赋予j
            }
        /**********found**********/
        return x[j];//返回最小值
        /*
        为什么不直接返回x[i]?
        因为i的值仅仅在for循环中使用，必须赋值给j
        */
    }
    void main()
    {
        int i;
        double x[N], av, m;
        for (i = 0; i < N; i++)
        {
            x[i] = rand() % 50;
            printf("%4.0f ", x[i]);
        }
        printf("\n");
        m = fun(x, &av);
        printf("\nThe average is: %f\n", av);
        printf("m=%5.1f ", m);
        printf("\n");
    }

    /*********************************************程序修改*************************************************/
#include <stdlib.h>
#include <conio.h>
#include <stdio.h>
    /*************found**************/
    float fun(int n)//返回值为float型，所以函数为float型
    {
        float A = 1;
        int i;
        /*************found**************/
        for (i = 2; i <= n; i++)
            A = 1.0 / (1 + A);
        return A;
    }

    /*
    该题中函数fun的作用是计算数列前n项和而数列的组成方式是：第n项的分母是1加第n-1的值，分子是1
    如果循环累加按for(i<2;i<=n;i++)执行，当输入n=2时循环不会执行，，程序将得不到想要的结果，因此
    循环变量的取值范围应该包括2，循环条件为i<=n;
    *//
    void main()
    {
        int n;
        system("CLS");
        printf("\nPlease enter n: ");
        scanf("%d", &n);
        printf("A%d=%lf\n", n, fun(n));
    }
    /*********************************************程序设计*************************************************/

#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define N 5
//第一种
void fun(int a[][N], int m)
    {
        int i, j;
        for(j = 0; j < N; j++)
        {
            for( i = 0; i <= j; i++)
            {
                a[i][j]=a[i][j]*m;
            }
            
        }
//第二种
void fun(int a[][N], int m)
{
int i,j;
for(i=0;i<N;i++)
for( j = 0; j < N; j++)
{
    if(i<=j) a[i][j] *=2;
}
//return ;
//因为函数void型，可以没有返回值

}

        /*本程序实现将矩阵右半上角元素中的值乘以m
            先第一次循环控制行左边，
            第二次循环控制列坐标
            *****The array*****
                1   7  14   0   9
                4  18  18   2   4
                5   5   1   7   1
                11  15   2   7  16
                11   4   2  13  12
                m=   2
                THE RESULT
                2  14  28   0  18
                4  36  36   4   8
                5   5   2  14   2
                11  15   2  14  32
                11   4   2  13  24
               
         */

  for(
    }
    void main()
    {
        int a[N][N], m, i, j;
        FILE *out;
        printf("*****The array*****\n");
        for (i = 0; i < N; i++)
        {
            for (j = 0; j < N; j++)
            {
                a[i][j] = rand() % 20;
                printf("%4d", a[i][j]);
            }
            printf("\n");
        }
        m = rand() % 4;
        printf("m=%4d\n", m);
        fun(a, m);
        printf("THE RESULT\n");
        for (i = 0; i < N; i++)
        {
            for (j = 0; j < N; j++)
                printf("%4d", a[i][j]);
            printf("\n");
        }
        /******************************/
        out = fopen("out.dat", "w");
        for (i = 0; i < N; i++)
            for (j = 0; j < N; j++)
                a[i][j] = i * j;
        fun(a, 8);
        for (i = 0; i < N; i++)
        {
            for (j = 0; j < N; j++)
                fprintf(out, "%4d", a[i][j]);
            fprintf(out, "\n");
        }
        fclose(out);
        /******************************/
    }
    /*********************************************试题四*************************************************/


    /*********************************************程序填空*************************************************/
#include <stdlib.h>
#include <stdio.h>
#define N 10
    double fun(double *x)
    {
        int i, j;
        double s, av, y[N];
        s = 0;
        for (i = 0; i < N; i++)
            s = s + x[i];
        /**********found**********/
        av = s / N;
        for (i = j = 0; i < N; i++)
            if (x[i] > av)
            {
                /**********found**********/
                y[j++] = x[i];
                x[i] = -1;
            }
        for (i = 0; i < N; i++)
            /**********found**********/
            if (x[i] != -1)
                y[j++] = x[i];
        for (i = 0; i < N; i++)
            x[i] = y[i];
        return av;
    }
    void main()
    {
        int i;
        double x[N];
        for (i = 0; i < N; i++)
        {
            x[i] = rand() % 50;
            printf("%4.0f ", x[i]);
        }
        printf("\n");
        printf("\nThe average is: %f\n", fun(x));
        printf("\nThe result :\n", fun(x));
        for (i = 0; i < N; i++)
            printf("%5.0f ", x[i]);
        printf("\n");
    }

    /*********************************************程序修改*************************************************/
#include <stdlib.h>
#include <string.h>
#include <conio.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>
    /*************found**************/
    void upfst(char *p)
    //下方p为指针类型，所以*p

    {
        int k = 0;
        for (; *p; p++)
            if (k)
            {
                if (*p == ' ')
                    k = 0;
            }
            else
            {
                if (*p != ' ')
                {
                    k = 1;
                    *p = toupper(*p);
                }
            }
    }
    void main()
    {
        char chrstr[81];
        system("CLS");
        printf("\nPlease enter an English text line: ");
        gets(chrstr);
        printf("\nBofore changing:\n  %s", chrstr);
        upfst(chrstr);
        printf("\nAfter changing:\n  %s\n", chrstr);
    }

    /*********************************************程序设计*************************************************/
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
#define N 5
    double fun(int w[][N])
    {
     //方法一
        int i, j, a = 0;
        double av = 0.0, sum = 0.0;
        for (i = 0; i < N; i++)
            for (j = 0; j < N; j++)
                if (i == 0 || j == 0 || i == N - 1 || j == N - 1)
                {
                    sum = sum + w[i][j];
                    a++;
                }
        av = sum / a;
        return av;
    //方法2
    int i,j,k=0;
double sum = 0.0;
for (i = 0; i < N; i++)
    for (j = 0; j < N; j++)
        if (i == 0 || j == 0 || i == N - 1 || j == N - 1)
        {
            sum = sum + w[i][j];
            k++;
        }
        return sum/k;
    }
    /*思路
    先定义行纵坐标以及和sum，因为需要进行求平均数，所以求出一共多少数，加入变量k；
    注意变量k以及sum初始化值
    遍历全部元素，然后通过
         if (i == 0 || j == 0 || i == N - 1 || j == N - 1)
         找到边界元素
         求和求平均值
         */
    void main()
    {
        FILE *wf;
        int a[N][N] = {0, 1, 2, 7, 9, 1, 9, 7, 4, 5, 2, 3, 8, 3, 1, 4, 5, 6, 8, 2, 5, 9, 1, 4, 1};
        int i, j;
        double s;
        system("CLS");
        printf("*****The array*****\n ");
        for (i = 0; i < N; i++)
        {
            for (j = 0; j < N; j++)
            {
                printf("%4d ", a[i][j]);
            }
            printf("\n ");
        }
        s = fun(a);
        printf("*****THE RESULT*****\n ");
        printf("The sum is : %lf\n ", s);
        /******************************/
    wf = fopen("out.dat", "w");
    fprintf(wf, "%lf", s);
    fclose(wf);
    /*****************************/
    }

    /*********************************************试题五***************************************************/

    /*********************************************程序填空*************************************************/
#include <stdlib.h>
#include <stdio.h>
#define N 10
    double fun(double *x)
    {
        int i, j;
        double av, y[N];
        av = 0;
        for (i = 0; i < N; i++)
            /**********found**********/
            av += x[i]/N;
            /*
            传递来的是x[i],所以使用的是x[i]中元素
            av代表平均值，所以应该是 av +=x[i]/N
            */
        for (i = j = 0; i < N; i++)
            if (x[i] < av)
            {
                y[j] = x[i];
                x[i] = -1;
                /**********found**********/
                j++;
            /*通过for循环和if判断来找到X[i]中比平均数小的值，并把这些值赋予给y[j],所以应该为
            ++j或者j++
            */
            }
        i = 0;
        while (i < N)
        {
            if (x[i] != -1)
                y[j++] = x[i];
            /**********found**********/
            i++;
            /*通过where循环，把x[i]中比平均值大的数放在数组y的后半部分
            所以是++i或者i++；
        }
        for (i = 0; i < N; i++)
            x[i] = y[i];
        return av;
    }
    void main()
    {
        int i;
        double x[N];
        for (i = 0; i < N; i++)
        {
            x[i] = rand() % 50;
            printf("%4.0f ", x[i]);
        }
        printf("\n");
        printf("\nThe average is: %f\n", fun(x));
        printf("\nThe result :\n", fun(x));
        for (i = 0; i < N; i++)
            printf("%5.0f ", x[i]);
        printf("\n");
    }

 /*********************************************程序修改*************************************************/
#include <stdlib.h>
#include <conio.h>
#include <stdio.h>
            /*************found**************/
            void fun(char *s, int num[5])  //函数定义必须要返回类型，如int  double，void
            {
                int k, i = 5;
                for (k = 0; k < i; k++)
                    /*************found**************/
                    num[k] = 0;//i值不变，k值变化
                for (; *s; s++)
                {
                    i = -1;
                    /*************found**************/
                    switch (*s)//s是地址，*s是地址值
                    {
                    case 'a':
                    case 'A':
                    {
                        i = 0;
                        break;
                    }
                    case 'e':
                    case 'E':
                    {
                        i = 1;
                        break;
                    }
                    case 'i':
                    case 'I':
                    {
                        i = 2;
                        break;
                    }
                    case 'o':
                    case 'O':
                    {
                        i = 3;
                        break;
                    }
                    case 'u':
                    case 'U':
                    {
                        i = 4;
                        break;
                    }
                    }
                    if (i >= 0)
                        num[i]++;
                }
            }
            void main()
            {
                char s1[81];
                int num1[5], i;
                system("CLS");
                printf("\nPlease enter a string: ");
                gets(s1);
                fun(s1, num1);
                for (i = 0; i < 5; i++)
                    printf("%d ", num1[i]);
                printf("\n");
            }

       
        /*********************************************程序设计*************************************************/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#define M 4
#define N 5
            int fun(int a[M][N])
            {
                int i,j,sum=0;//定义行纵坐标以及和
                //遍历全部元素
                for(i=0;i<M;i++)
                    for(j=0;j<M;j++)
                    //只要行纵坐标为0或者M-1,N-1，肯定是边上
                        if(i==0||i==M-1||j==0||j==N-1)
                        sum=sum=a[i][j];
                        return sum;


            }
            void main()
            {
                FILE *wf;
                int aa[M][N] = {{1, 3, 5, 7, 9}, {2, 9, 9, 9, 4}, {6, 9, 9, 9, 8}, {1, 3, 5, 7, 0}};
                int i, j, y;
                system("CLS");
                printf("The original data is :\n ");
                for (i = 0; i < M; i++)
                {
                    for (j = 0; j < N; j++)
                        printf("%6d ", aa[i][j]);
                    printf("\n ");
                }
                y = fun(aa);
                printf("\nThe sun: %d\n ", y);
                printf("\n ");
                /******************************/
                wf = fopen("out.dat", "w");
                fprintf(wf, "%d", y);
                fclose(wf);
                /*****************************/
            }

       

        /*********************************************试题六*************************************************/


        /*********************************************程序填空*************************************************/

#include <stdio.h>
#include <string.h>
#include <ctype.h>
#define N 9
            long ctod(char *s)
            {
                long d = 0;
                while (*s)
                    if (isdigit(*s)) //isdigit是计算机C(C++)语言中的一个函数，主要用于检查其参数是否为十进制数字字符。
                    {
                        /**********found**********/
                        d = d * 10 + *s - __1__; 
                        /*d = d * 10 + *s -?表示要把字符型分别转换为字符相等的整数
                        字符‘0’的ascll码为48，
                        ‘3’为21
                    
                        所以字符‘3’-‘0’所得即为整数3
                        /**********found**********/
                        d++;
                        /**s中所代表的字符串中字符需要一个一个的字符进行转换成整数，因此
                         填写s++或者++s；
                         */
                    }
                return d;
            }
            long fun(char *a, char *b)
            {
                /**********found**********/
                return ctod(a)+ctod(b);//main()函数输入的s1+s2通过ctod转换，在这里相加
            }
            void main()
            {
                char s1[N], s2[N];
                do
                {
                    printf("Input  string  s1 : ");
                    gets(s1);
                } while (strlen(s1) > N);
                do
                {
                    printf("Input  string  s2 : ");
                    gets(s2);
                } while (strlen(s2) > N);
                printf("The result is:  %ld\n", fun(s1, s2));
            }

        /*********************************************程序修改*************************************************/

#include <stdio.h>
            /**********found**********/
            void fun(char *s, int *a, int *b)
            /*  主函数 fun ( s,  & upper, &lower );
	说明a，b也是指针*/
            {
                while (*s)
                {
                    if (*s >= 'A' && *s <= 'Z')
                        /**********found**********/
                        *a = *a + 1;
                    if (*s >= 'a' && *s <= 'z')
                        /**********found**********/
                        *b = *b + 1;
                    /*s是地址
	 *a才是值，可以运算
	 */
                    s++;
                }
            }

            void main()
            {
                char s[100];
                int upper = 0, lower = 0;
                printf("\nPlease a string :  ");
                gets(s);
                fun(s, &upper, &lower);
                printf("\n upper = %d  lower = %d\n", upper, lower);
            }

        /*********************************************程序设计*************************************************/
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
            float fun(float h)
            {
                int tmp=(int)(h*1000+5)/10;
                /*
                单精度h乘以1000再加5，相当于h中的第三位小数进行四舍五入，
                除以10后将其值赋给一个长整型时就把第三位小数后的数全部截去
                */
                return (float)tmp/100.0;
            }

            /*
            注意：
            本题要求对h的值真正进行四舍五入运算，而不是为了输出，即不能通过printf("%7.2f",h)进行输出直接得到结果
            四舍五入算法：
                如果精度要求到小数点后n位，则需要对第n+1位进行运算，
                方法是将该小数乘以10的n+1次方后加五，然后除以10并强制转换变量类型为整形
                再将该数除以10的n次方，同时强制转换为浮点型
                代码实现如下：
                int t;    定义整型变量t
                t=(int)(h*pow(10,n+1))/10;对h进行操作，得到值浮点型，t取值时取整数部分，pow(10,n+1)为扩大的倍数
                h=(float)t/pow(10,n),将t缩小n倍，并转换为浮点型


            void main()
            {
                FILE *wf;
                float a;
                system("CLS");
                printf("Enter a: ");
                scanf("%f", &a);
                printf("The original data is :  ");
                printf("%f\n\n", a);
                printf("The  result : %f\n", fun(a));
                /******************************/
                wf = fopen("out.dat", "w");
                fprintf(wf, "%f", fun(8.32533));
                fclose(wf);
                /*****************************/
            }

/*********************************************试题七*************************************************/
/*********************************************程序填空*************************************************/
#include <stdlib.h>
#include <stdio.h>
#define N 20
            void fun(int *a)
            {
                int i, x, n = 0;
                x = rand() % 20;
                /**********found**********/
                while (n < N)
                //一共循环20次，n代表下标
                {
                    for (i = 0; i < n; i++)
                        /**********found**********/
                        if (x == a[i])//判断是否存在
                            break;//如果存在则跳出
                    /**********found**********/
                    if (i == n)
                    {
                        a[n] = x;
                        n++;
                    }
                    /*
                    若for循环是由于break跳出结束的，，则x与数组中的元素重复，此时i必然小于n
                    如果for循环是因为循环变量i递增到某值，而不是满足循环条件结束的，说明x的值与数组中的元素不重复
                    则此时i的值等于n
                    */
                    x = rand() % 20;
                }
            }
            void main()
            {
                int x[N] = {0}, i;
                fun(x);
                printf("The result :  \n");
                for (i = 0; i < N; i++)
                {
                    printf("%4d", x[i]);
                    if ((i + 1) % 5 == 0)
                        printf("\n");
                }
                printf("\n\n");
            }



/*********************************************程序修改*************************************************/
#include <stdio.h>
            void fun()
            {
                int a[3][3], sum;
                int i, j;
                /*************found**************/
                sum = 0;//sum初始化应该为0
                for (i = 0; i < 3; i++)
                {
                    for (j = 0; j < 3; j++)
                        /*************found**************/
                        scanf("%d", &a[i][j]);//scanf("%d",&a)地址符不能丢失
                }
                for (i = 0; i < 3; i++)
                    sum = sum + a[i][i];
                printf("Sum=%d\n", sum);
            }
            void main()
            {
                fun();
            }

            /*********************************************程序设计*************************************************/
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>

            void fun(int array[3][3])
            {
                int i,j,t;
                for(i=0;i<3;i++)
                for(j=0;j<3;j++)
               {
                t=array[i][j];
                array[i][j] = array[j][i] ;
                array[j][i]=t;
               }
            }
            //对角元素互换
             100  200  300
             400  500  600 
             700  800  900 
             Converted array :
             100  200  300 
             400  500  600 
             700  800  900 
             请按任意键继续...

                void
                main()
            {
                FILE *wf;
                int i, j;
                int array[3][3] = {{100, 200, 300}, {400, 500, 600}, {700, 800, 900}};
                system("CLS");
                for (i = 0; i < 3; i++)
                {
                    for (j = 0; j < 3; j++)
                        printf("%7d ", array[i][j]);
                    printf("\n ");
                }
                fun(array);
                printf("Converted array:\n ");
                for (i = 0; i < 3; i++)
                {
                    for (j = 0; j < 3; j++)
                        printf("%7d ", array[i][j]);
                    printf("\n ");
                }
                /******************************/
                wf = fopen("out.dat", "w");
                for (i = 0; i < 3; i++)
                {
                    for (j = 0; j < 3; j++)
                        fprintf(wf, "%7d ", array[i][j]);
                    fprintf(wf, "\n");
                }
                fclose(wf);
                /*****************************/
            }
/*********************************************试题八*************************************************/

/*********************************************程序填空*************************************************/
#include <stdio.h>
#define N 4
        void fun(int(*a)[N], int *b)
        {
            int i, j;
            for (i = 0; i < N; i++)
            {
                /**********found**********/
                b[i] = a[0][i];
                //计算的是每列最大的元素，所以从每列第一个元素开始
                for (j = 1; j < N; j++)
                    /**********found**********/
                    if (b[i] < a[j][i])
                    //如果新数大于b[i],则替换掉
                        b[i] = a[j][i];
            }
        }
        void main()
        {
            int x[N][N] = {{12, 5, 8, 7}, {6, 1, 9, 3}, {1, 2, 3, 4}, {2, 8, 4, 3}}, y[N], i, j;
            printf("\nThe matrix :\n");
            for (i = 0; i < N; i++)
            {
                for (j = 0; j < N; j++)
                    printf("%4d", x[i][j]);
                printf("\n");
            }
            /**********found**********/
            fun(x, y);
            //里面是两个数组
            printf("\nThe result is:");
            for (i = 0; i < N; i++)
                printf("%3d", y[i]);
            printf("\n");
        }

        /*********************************************程序修改*************************************************/
#include <stdio.h>
        /*************found**************/
        void fun(int *x, int *y)

        //函数fun里面参数是地址，所以用指针
        {
            int t;
            /*************found**************/
            t = *x;
            *x = *y;
            *y = t;
            //传递的是值，不是地址，所以加*
        }
        void main()
        {
            int a, b;
            a = 8;
            b = 3;
            fun(&a, &b);
            printf("%d  %d\n ", a, b);
        }

        /*********************************************程序设计*************************************************/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#define MAX 100
        int fun(int lim, int aa[MAX])
        {
            int i,j,k=0;
            for(i=2;i<=lim;i++)
            //求出小于或者等于lim的全部素数
            {
                for(j=2;j<i;j++)
                if(i%j==0) break;
                if(j>=i)//判断是否循环完
                aa[k++]=i;
                //将求得的素数放在数组aa中
            }
            return k;
            //返回所求出的素数
            /*
            思路：
                先遍历全部小于lim的数，然后求得后再判断是否为素数
                        for(i=2;i<=lim;i++)
            然后判断是否为素数
                    for(j=2;j<i;j++)
                if(i%j==0) break;


        }
        void main()
        {
            FILE *wf;
            int limit, i, sum;
            int aa[MAX];
            system("CLS");
            printf("输入一个整数:");
            scanf("%d", &limit);
            sum = fun(limit, aa);
            for (i = 0; i < sum; i++)
            {
                if (i % 10 == 0 && i != 0) /*每行输出10个数*/
            printf("\n ");
            printf("%5d ", aa[i]);
            }
            /******************************/
            wf = fopen("out.dat", "w");
            sum = fun(15, aa);
            for (i = 0; i < sum; i++)
            {
                if (i % 10 == 0 && i != 0) /*每行输出10个数*/
                    fprintf(wf, "\n");
                fprintf(wf, "%5d ", aa[i]);
            }
            fclose(wf);
            /*****************************/
        }


        /*********************************************试题九*************************************************/

        /*********************************************程序填空*************************************************/
        使用VC++ 2010打开考生文件夹下blank1中的解决方案。此解决方案的项目中包含一个源程序文件blank1.c。 在此程序中，函数fun的功能是建立一个N×N的矩阵。 矩阵元素的构成规律是：最外层元素的值全部为1；从外向内第2层元素的值全部为2；第3层元素的值全部为3，……依此类推。 例如，若N＝5，生成的矩阵为： 1 1 1 1 1 1 2 2 2 1 1 2 3 2 1 1 2 2 2 1 1 1 1 1 1

            请在程序的下画线处填入正确的内容并把下画线删除，使程序得出正确的结果。
#include <stdio.h>
#define N 7
            /**********found**********/

            void
            fun(int (*a)[N]) //本题考查了形参的确定。参数传递时将实参的值赋给形参，实参和形参是一一对应的，因此该空应该填写[N]。
        {
            int i, j, k, m;
            if (N % 2 == 0)
                m = N / 2;
            else
                m = N / 2 + 1;
            for (i = 0; i < m; i++)
            {
                /**********found**********/
                for (j = i; j < N - i; j++)
                    a[i][j] = a[N - i - 1][j] = i + 1;
                for (k = i + 1; k < N - i; k++)
                    /**********found**********/
                    a[k][i] = a[k][N - i - 1] = i+1__3__;
            }
        }
        void main()
        {
            int x[N][N] = {0}, i, j;
            fun(x);
            printf("\nThe result is:\n");
            for (i = 0; i < N; i++)
            {
                for (j = 0; j < N; j++)
                    printf("%3d", x[i][j]);
                printf("\n");
            }
        }

        /*********************************************程序修改*************************************************/
#include <stdio.h>
#include <conio.h>
        /*************found**************/
        //void fun(int m, int k) ;
        void fun(int m, int k)
        {
            int aa[20], i;
            for (i = 0; m; i++)
            {
                /*************found**************/
                //  aa[i] = m /k;
                aa[i] = m % k;
                m /= k;
            }
            for (; i; i--)
                /*************found**************/
                //printf("%d", aa[i ]);
                printf("%d", aa[i - 1]);
        }
        void main()
        {
            int b, n;
            printf("\nPlease enter a number and a base:\n");
            scanf("%d%d", &n, &b);
            fun(n, b);
            printf("\n ");
        }

        /*********************************************程序设计*************************************************/

        /*********************************************试题十*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十一*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十二*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/
        /*********************************************试题十三*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十四*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十五*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十六*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十七*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十八*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题十九*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题二十*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题二十一*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/

        /*********************************************试题二十二*************************************************/

        /*********************************************程序填空*************************************************/

        /*********************************************程序修改*************************************************/

        /*********************************************程序设计*************************************************/
